---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.StartCutShadowJoin
source: html/2108b22f-59a2-d363-79ba-2f1574eea1e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.StartCutShadowJoin Property

Two joined walls are in a position to allow automatic insert copying.

## Syntax (C#)
```csharp
public static FailureDefinitionId StartCutShadowJoin { get; }
```